tap "1password/tap" if OS.mac?

# Essential software
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-compose"
brew "findutils"
brew "git"
brew "mas" if OS.mac?
brew "mercurial"
brew "mosh"
brew "screen"
brew "tmux"
brew "wget"
brew "zsh"

# Compression
brew "p7zip"
brew "sevenzip"
brew "unzip"
brew "xz"
brew "zstd"

# Library dependencies
brew "berkeley-db"
brew "gdbm"
brew "ncurses"
brew "net-snmp"

# Markup/Markdown helpers
brew "jq"
brew "shyaml"
brew "yamllint"
brew "yq"

# Developer tools
brew "ansible"
brew "cmake"
brew "cscope"
brew "ctags"

# Languages
brew "go"
brew "lua"
brew "perl"
brew "python@3.12"
brew "ruby"
brew "brew-gem"

# I install vim after the above so it gets built the way I want it
brew "vim"

# All the other stuff to make it fun
brew "ack"
brew "bat"
brew "colordiff"
brew "htop"
brew "nb"
brew "nmap" if OS.linux?
brew "pandoc"
brew "telnet" if OS.mac?
brew "tree"
brew "watch"
brew "w3m"

# ---------------------------------------------------------------------------
# GUI applications (macOS)
# Reconciled 2026-07-21 against installed apps in /Applications and the curated
# installer set in ~/SynologyDrive/Home/Apps. Human-readable notes live in
# Apps.md at the repo root -- keep the two in sync.
# ---------------------------------------------------------------------------
if OS.mac? then
  # Password manager
  cask "1password"
  cask "1password-cli"

  # Launcher, window & menu-bar management
  cask "alfred"
  cask "rectangle-pro"
  cask "witch"
  cask "thaw"                   # menu-bar manager

  # Terminal / editors
  cask "iterm2"
  cask "cursor"
  cask "qt-creator"

  # Cloud, sync & networking
  cask "synology-drive"         # bootstrap prerequisite: pulls down configs/keys
  cask "google-drive"
  cask "tailscale"
  cask "wifiman"

  # AI / notes / productivity
  cask "claude"
  cask "claude-code"
  cask "notion"
  cask "notion-cli"
  cask "antinote"

  # Media & audio
  cask "spotify"
  cask "tidal"
  cask "sonos"
  cask "bluos-controller"
  cask "vlc"

  # Peripherals
  cask "elgato-stream-deck"
  cask "logitune"
  cask "logi-options-plus"

  # 3D printing / CAD / maker
  cask "bambu-studio"
  cask "orcaslicer"
  cask "prusaslicer"
  cask "openscad"
  cask "autodesk-fusion"

  # SDR / radio
  cask "gqrx"

  # Utilities
  cask "appcleaner"
  cask "quitall"
  cask "balenaetcher"
  cask "macfuse"
  cask "sshfs-mac"
  cask "cursr"
  cask "filebot"
  cask "mqtt-explorer"          # replaces the old App Store "MQTT Explorer" (you run the beta dmg)
  cask "zoom"

  # Cloud SDK (renamed from google-cloud-sdk)
  cask "gcloud-cli"

  # Fonts
  cask "font-inconsolata-nerd-font"
  cask "font-meslo-for-powerline"

  # Mac App Store apps
  mas "Amphetamine",  id: 937984704
  mas "Balance Lock", id: 1019371109
  mas "HP Smart",     id: 1474276998
  mas "Marked 2",     id: 890031187
  mas "NordVPN",      id: 905953485
  mas "Slack",        id: 803453959
  mas "Things",       id: 904280696
  mas "Windows App",  id: 1295203466
  mas "WireGuard",    id: 1451685025
  mas "Xcode",        id: 497799835
end
