tap "1password/tap" if OS.mac?
tap "homebrew/bundle"

# Essential software
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-compose"
brew "findutils"
brew "git"
brew "mas" if OS.mac?
brew "mercurial"
brew "mosh"
brew "screen"
brew "tmux"
brew "wget"
brew "zsh"

# Compression
brew "p7zip"
brew "sevenzip"
brew "unzip"
brew "xz"
brew "zstd"

# Library dependencies
brew "berkeley-db"
brew "gdbm"
brew "ncurses"
brew "net-snmp"

# Markup/Markdown helpers
brew "jq"
brew "shyaml"
brew "yamllint"
brew "yq"

# Developer tools
brew "ansible"
brew "cmake"
brew "cscope"
brew "ctags"

# Languages
brew "go"
brew "lua"
brew "perl"
brew "python@3.12"
brew "ruby"
brew "brew-gem"

# I install vim after the above so it gets built the way I want it
brew "vim"

# All the other stuff to make it fun
brew "ack"
brew "bat"
brew "colordiff"
brew "htop"
brew "nb"
brew "nmap" if OS.linux?
brew "pandoc"
brew "telnet" if OS.mac?
brew "tree"
brew "watch"
brew "w3m"

if OS.mac? then
  cask "1password-cli"
  cask "balenaetcher"
  cask "divvy"
  cask "font-inconsolata-nerd-font"
  cask "font-meslo-for-powerline"
  cask "google-cloud-sdk"
  cask "sizeup"
  cask "sonos"
  cask "spotify"
  cask "ukelele"
  cask "witch"

  mas "Amphetamine", id: 937984704
  mas "Balance Lock", id: 1019371109 if OS.mac?
  mas "HP Smart", id: 1474276998 if OS.mac?
  mas "Marked 2", id: 890031187
  mas "MQTT Explorer", id: 1455214828
  mas "Slack", id: 803453959
  mas "Things", id: 904280696
  mas "Windows App", id: 1295203466
  mas "WireGuard", id: 1451685025
  mas "Xcode", id: 497799835
end
